# Задача-1:
# Писать небольшую консольную утилиту,
# позволяющая работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в которых будут пункты:
# 1. Перейти в папку
# 2. Просмотр содержимого итого папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано / удалено / перешел",
# "Невозможно создать / удалить / перейти"

# Для решения данной задачи с использованием простых алгоритмов,
# оформленные в виде закон функций,
# и импортированные в данный файл из easy.py